title: Possible Windows DLL Hijacking
id: 980b0288-2174-418f-b64b-c9c8fb9a74fb
status: experimental
description: Detects possible DLL hijacking of vulnerable Windows DLLs not under the Windows folder.
references:
    - https://wietze.github.io/blog/hijacking-dlls-in-windows
author: "@Wietze"
date: 2020/06/22
tags:
    - attack.defense_evasion
    - attack.T1038
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 7
        ImageLoaded:
           - "*\\activeds.dll"
           - "*\\adsldpc.dll"
           - "*\\aepic.dll"
           - "*\\apphelp.dll"
           - "*\\appxalluserstore.dll"
           - "*\\appxdeploymentclient.dll"
           - "*\\archiveint.dll"
           - "*\\atl.dll"
           - "*\\audioses.dll"
           - "*\\auditpolcore.dll"
           - "*\\authfwcfg.dll"
           - "*\\authz.dll"
           - "*\\avrt.dll"
           - "*\\bcd.dll"
           - "*\\bcp47langs.dll"
           - "*\\bcp47mrm.dll"
           - "*\\bderepair.dll"
           - "*\\bootmenuux.dll"
           - "*\\cabinet.dll"
           - "*\\certenroll.dll"
           - "*\\cldapi.dll"
           - "*\\clipc.dll"
           - "*\\clusapi.dll"
           - "*\\cmpbk32.dll"
           - "*\\coloradapterclient.dll"
           - "*\\colorui.dll"
           - "*\\coremessaging.dll"
           - "*\\credui.dll"
           - "*\\cryptbase.dll"
           - "*\\cryptdll.dll"
           - "*\\cryptui.dll"
           - "*\\cryptxml.dll"
           - "*\\cscapi.dll"
           - "*\\d2d1.dll"
           - "*\\d3d10_1.dll"
           - "*\\d3d10_1core.dll"
           - "*\\d3d10.dll"
           - "*\\d3d10core.dll"
           - "*\\d3d10warp.dll"
           - "*\\d3d11.dll"
           - "*\\d3d12.dll"
           - "*\\d3d9.dll"
           - "*\\d3dcompiler_47.dll"
           - "*\\dbgcore.dll"
           - "*\\dbghelp.dll"
           - "*\\dcntel.dll"
           - "*\\dcomp.dll"
           - "*\\deviceassociation.dll"
           - "*\\devicecredential.dll"
           - "*\\devobj.dll"
           - "*\\devrtl.dll"
           - "*\\dhcpcmonitor.dll"
           - "*\\dhcpcsvc.dll"
           - "*\\dhcpcsvc6.dll"
           - "*\\dismapi.dll"
           - "*\\dmcfgutils.dll"
           - "*\\dmcmnutils.dll"
           - "*\\dmenrollengine.dll"
           - "*\\dmenterprisediagnostics.dll"
           - "*\\dmiso8601utils.dll"
           - "*\\dmoleaututils.dll"
           - "*\\dmprocessxmlfiltered.dll"
           - "*\\dmpushproxy.dll"
           - "*\\dmxmlhelputils.dll"
           - "*\\dnsapi.dll"
           - "*\\dot3api.dll"
           - "*\\dot3cfg.dll"
           - "*\\dpx.dll"
           - "*\\dsclient.dll"
           - "*\\dsparse.dll"
           - "*\\dsreg.dll"
           - "*\\dsrole.dll"
           - "*\\dui70.dll"
           - "*\\dusmapi.dll"
           - "*\\dwmapi.dll"
           - "*\\dwmcore.dll"
           - "*\\dwrite.dll"
           - "*\\dxgi.dll"
           - "*\\dxva2.dll"
           - "*\\dynamoapi.dll"
           - "*\\eappcfg.dll"
           - "*\\eappprxy.dll"
           - "*\\edputil.dll"
           - "*\\efsadu.dll"
           - "*\\efsutil.dll"
           - "*\\esent.dll"
           - "*\\faultrep.dll"
           - "*\\feclient.dll"
           - "*\\fhsvcctl.dll"
           - "*\\firewallapi.dll"
           - "*\\fltlib.dll"
           - "*\\fveapi.dll"
           - "*\\fwbase.dll"
           - "*\\fwcfg.dll"
           - "*\\fwpolicyiomgr.dll"
           - "*\\fwpuclnt.dll"
           - "*\\fxsapi.dll"
           - "*\\fxstiff.dll"
           - "*\\getuname.dll"
           - "*\\hid.dll"
           - "*\\hnetmon.dll"
           - "*\\httpapi.dll"
           - "*\\ieadvpack.dll"
           - "*\\iedkcs32.dll"
           - "*\\iertutil.dll"
           - "*\\ifmon.dll"
           - "*\\inproclogger.dll"
           - "*\\iphlpapi.dll"
           - "*\\iri.dll"
           - "*\\iscsidsc.dll"
           - "*\\iscsium.dll"
           - "*\\iumbase.dll"
           - "*\\joinutil.dll"
           - "*\\kdstub.dll"
           - "*\\ksuser.dll"
           - "*\\ktmw32.dll"
           - "*\\licensemanagerapi.dll"
           - "*\\linkinfo.dll"
           - "*\\loadperf.dll"
           - "*\\logoncli.dll"
           - "*\\magnification.dll"
           - "*\\maintenanceui.dll"
           - "*\\mapistub.dll"
           - "*\\mdmdiagnostics.dll"
           - "*\\mfcore.dll"
           - "*\\mfplat.dll"
           - "*\\mi.dll"
           - "*\\midimap.dll"
           - "*\\mintdh.dll"
           - "*\\miutils.dll"
           - "*\\mlang.dll"
           - "*\\mmdevapi.dll"
           - "*\\mobilenetworking.dll"
           - "*\\mprapi.dll"
           - "*\\mrmcorer.dll"
           - "*\\msacm32.dll"
           - "*\\mscms.dll"
           - "*\\mscoree.dll"
           - "*\\msctfmonitor.dll"
           - "*\\msdrm.dll"
           - "*\\msdtctm.dll"
           - "*\\msftedit.dll"
           - "*\\msi.dll"
           - "*\\msutb.dll"
           - "*\\mtxclu.dll"
           - "*\\ndfapi.dll"
           - "*\\netid.dll"
           - "*\\netiohlp.dll"
           - "*\\netplwiz.dll"
           - "*\\netshell.dll"
           - "*\\nettrace.dll"
           - "*\\netutils.dll"
           - "*\\newdev.dll"
           - "*\\ninput.dll"
           - "*\\nlaapi.dll"
           - "*\\nshhttp.dll"
           - "*\\nshipsec.dll"
           - "*\\nshwfp.dll"
           - "*\\ntdsapi.dll"
           - "*\\ntlmshared.dll"
           - "*\\oleacc.dll"
           - "*\\omadmapi.dll"
           - "*\\onex.dll"
           - "*\\osbaseln.dll"
           - "*\\osksupport.dll"
           - "*\\osuninst.dll"
           - "*\\p2p.dll"
           - "*\\p2pnetsh.dll"
           - "*\\pcaui.dll"
           - "*\\pdh.dll"
           - "*\\peerdistsh.dll"
           - "*\\policymanager.dll"
           - "*\\polstore.dll"
           - "*\\printui.dll"
           - "*\\propsys.dll"
           - "*\\prvdmofcomp.dll"
           - "*\\puiapi.dll"
           - "*\\radcui.dll"
           - "*\\rasapi32.dll"
           - "*\\rasman.dll"
           - "*\\rasmontr.dll"
           - "*\\reagent.dll"
           - "*\\regapi.dll"
           - "*\\reseteng.dll"
           - "*\\resetengine.dll"
           - "*\\resutils.dll"
           - "*\\rmclient.dll"
           - "*\\rpcnsh.dll"
           - "*\\rtutils.dll"
           - "*\\rtworkq.dll"
           - "*\\samcli.dll"
           - "*\\samlib.dll"
           - "*\\sas.dll"
           - "*\\scansetting.dll"
           - "*\\scecli.dll"
           - "*\\schedcli.dll"
           - "*\\secur32.dll"
           - "*\\slc.dll"
           - "*\\snmpapi.dll"
           - "*\\spectrumsyncclient.dll"
           - "*\\spp.dll"
           - "*\\sppc.dll"
           - "*\\srclient.dll"
           - "*\\srcore.dll"
           - "*\\srpapi.dll"
           - "*\\srvcli.dll"
           - "*\\sspicli.dll"
           - "*\\staterepository.core.dll"
           - "*\\sxshared.dll"
           - "*\\systemsettingsthresholdadminflowui.dll"
           - "*\\tapi32.dll"
           - "*\\tbs.dll"
           - "*\\tdh.dll"
           - "*\\timesync.dll"
           - "*\\tquery.dll"
           - "*\\tsworkspace.dll"
           - "*\\ttdrecord.dll"
           - "*\\uiautomationcore.dll"
           - "*\\uireng.dll"
           - "*\\updatepolicy.dll"
           - "*\\upshared.dll"
           - "*\\userenv.dll"
           - "*\\utildll.dll"
           - "*\\uxinit.dll"
           - "*\\uxtheme.dll"
           - "*\\vaultcli.dll"
           - "*\\virtdisk.dll"
           - "*\\vssapi.dll"
           - "*\\vsstrace.dll"
           - "*\\wcmapi.dll"
           - "*\\wcnnetsh.dll"
           - "*\\wdi.dll"
           - "*\\wdscore.dll"
           - "*\\webservices.dll"
           - "*\\wecapi.dll"
           - "*\\wer.dll"
           - "*\\wevtapi.dll"
           - "*\\whhelper.dll"
           - "*\\wimgapi.dll"
           - "*\\winbrand.dll"
           - "*\\windowscodecs.dll"
           - "*\\windowsperformancerecordercontrol.dll"
           - "*\\winhttp.dll"
           - "*\\wininet.dll"
           - "*\\winipsec.dll"
           - "*\\winmde.dll"
           - "*\\winnsi.dll"
           - "*\\winsqlite3.dll"
           - "*\\winsta.dll"
           - "*\\wkscli.dll"
           - "*\\wlanapi.dll"
           - "*\\wlancfg.dll"
           - "*\\wldp.dll"
           - "*\\wmiclnt.dll"
           - "*\\wmpdui.dll"
           - "*\\wmsgapi.dll"
           - "*\\wofutil.dll"
           - "*\\wshelper.dll"
           - "*\\wtsapi32.dll"
           - "*\\wwancfg.dll"
           - "*\\wwapi.dll"
           - "*\\xmllite.dll"
           - "*\\xolehlp.dll"
    filter:
        EventID: 7
        ImageLoaded:
            - "C:\\Windows\\WinSxS\\*"
            - "C:\\Windows\\System32\\*"
            - "C:\\Windows\\SysWOW64\\*"
    condition: selection and not filter
falsepositives:
    - Very likely, needs more tuning
level: high
